#define words 74

byte Can1[] = {
  0x18};

// byte rev[] = {
//   0x1B, 0x49, 0x31};

String Letter = "";

char* Word[]=
{
  "まっさらな",
  "白紙を前に",
  "する遊びは",
  "はかりしれない",
  "最初の",
  "ウインドサーファー",
  "最初の",
  "小型ジェット機",
  "そしてこの最初の",
  "本格的",
  "ヘリオトピンは",
  "春のように",
  "あわく",
  "パウダリーな",
  "ミモザを思わせ",
  "はかなげな",
  "きらめきの表現が",
  "必要だったが",
  "アプレロンディは",
  "それをみごとに",
  "体現している",
  "しかし",
  "ゲランの常として",
  "それがすべてではない",
  "単純で",
  "安っぽいところのある",
  "ヘリオトープに",
  "憂鬱で",
  "パウダリーな",
  "アイリスを加えて補った",
  "ここでやめて",
  "四頭立ての馬車と",
  "灰色の",
  "オーストリッチの羽でも",
  "揃えれば",
  "理想の",
  "葬式になるだろう",
  "だがゲランは",
  "クラシックな",
  "香水に",
  "よく使う手として",
  "シェフが言うところの",
  "プロバンスのブーケ",
  "つまりローズマリー",
  "タイム",
  "セージを",
  "ほんの少し使うことで",
  "全体を",
  "明るい太陽の",
  "光で満たした",
  "このささやかな",
  "地上の喜びへの",
  "暗示によって",
  "アプレロンディは",
  "涙ぐみながらも",
  "微笑む",
  "数ある",
  "淡く",
  "ロマンティックな",
  "香水の中で",
  "アプレロンディだけが",
  "なぜか",
  "湧き上がるような",
  "みずみずしい",
  "ピアノの",
  "和音の響きを",
  "感じさせ",
  "ドビュッシーの楽曲も",
  "顔色なし",
  "いつの時代をとっても",
  "２０位までに入る",
  "すばらしい",
  "香水だ",
  "あの"
};

char* rtrn[]=
{
  "",
  "",
  "\r"
};

void setup()
{
  Serial.begin(9600);
  Serial.write(Can1, 1);
  randomSeed(analogRead(0));
}

void loop()
{
//  Serial.write(rev, 3);

  Serial.print("\r");

  Letter = Word[random(words)];
  Letter += rtrn[random(3)];
  Serial.print(Letter);

  Serial.print("\r");

  delay(1000);  // 1sec
}
