#define words 74

byte Can1[] = {
  0x18};

byte rev[] = {
  0x1B, 0x49, 0x31}; 

String Letter = "";

char* Word[]=
{ 
  "バナナに",
  "一人",
  "そろそろ",
  "あられといえば",
  "楽しいですね",
  "といったら",
  "柿の種のような",
  "本当に",
  "こうして",
  "大量に",
  "あられ",
  "といったら",
  "あ",
  "米といえば",
  "あ",
  "困らないので",
  "辛い",
  "赤い",
  "雪",
  "柿の種",
  "柿の種",
  "それも",
  "それが",
  "地獄絵図です",
  "私の故郷では",
  "黄色とも",
  "あ",
  "お空の",
  "バナナになってしまった",
  "毎晩降るのです",
  "積もるのですから",
  "どす黒い",
  "一人で",
  "あられも",
  "雨",
  "といったら",
  "感謝",
  "なってしまった",
  "日本の食文化",
  "ハバネロ",
  "本当に",
  "地獄のようです",
  "食糧には",
  "言葉遊びをするのも",
  "でも",
  "おかきといえば",
  "それが",
  "雪が",
  "一人",
  "降りますね",
  "言えないものが",
  "素晴らしいですね",
  "当たり前なのです",
  "雲の中から",
  "白くないのですよ",
  "ハバネロ",
  "神様に",
  "感激",
  "おかしな話でしょ",
  "辛い",
  "柿の種も",
  "マジカル",
  "おかきですね",
  "また",
  "私たちは",
  "茶色とも",
  "まことに",
  "柿の種のような",
  "米",
  "色までも",
  "マジカル",
  "嬉しいです",
  "寒くなってきましたね",
  "あの"
};

char* point[]=
{ 
  "、",  
  "。"  
};

void setup()
{
  Serial.begin(9600); 
  Serial.write(Can1, 1);
}

void loop()
{
  Serial.write(rev, 3);  

  Serial.print("\r\r\r"); 

  Letter = Word[random(words)];
  Letter += point[random(2)];
  Serial.print(Letter);

  Serial.print("\r\r\r");

  delay(60000);  // 1min
}


