#define words 74

byte Can1[] = {
  0x18};

byte rev[] = {
  0x1B, 0x49, 0x31};

String Letter = "";

char* Word[]=
{
  "まっさらな",
  "白紙を前に",
  "する遊びは",
  "はかりしれない",
  "最初の",
  "ウインドサーファー",
  "最初の",
  "小型ジェット機",
  "そしてこの最初の",
  "本格的",
  "ヘリオトピンは",
  "春のように",
  "あわく",
  "パウダリーな",
  "ミモザを思わせ",
  "はかなげな",
  "きらめきの表現が",
  "必要だったが",
  "アプレロンディは",
  "それをみごとに",
  "体現している",
  "しかし",
  "ゲランの常として",
  "それがすべてではない",
  "単純で",
  "安っぽいところのある",
  "ヘリオトープに",
  "憂鬱で",
  "パウダリーな",
  "アイリスを加えて補った",
  "ここでやめて",
  "四頭立ての馬車と",
  "灰色の",
  "オーストリッチの羽でも",
  "揃えれば",
  "理想の",
  "葬式になるだろう",
  "だがゲランは",
  "クラシックな",
  "香水に",
  "よく使う手として",
  "シェフが言うところの",
  "プロバンスのブーケ",
  "つまりローズマリー",
  "でも",
  "おかきといえば",
  "それが",
  "雪が",
  "一人",
  "降りますね",
  "言えないものが",
  "素晴らしいですね",
  "当たり前なのです",
  "雲の中から",
  "白くないのですよ",
  "ハバネロ",
  "神様に",
  "感激",
  "おかしな話でしょ",
  "辛い",
  "柿の種も",
  "マジカル",
  "おかきですね",
  "また",
  "私たちは",
  "茶色とも",
  "まことに",
  "柿の種のような",
  "米",
  "色までも",
  "マジカル",
  "嬉しいです",
  "寒くなってきましたね",
  "あの"
};

char* point[]=
{
  "、",
  "。"
};

void setup()
{
  Serial.begin(9600);
  Serial.write(Can1, 1);
}

void loop()
{
  Serial.write(rev, 3);

  Serial.print("\r\r\r");

  Letter = Word[random(words)];
  Letter += point[random(2)];
  Serial.print(Letter);

  Serial.print("\r\r\r");

  delay(10000);  // 10sec
}
